{
  "it": {
    "hero_title": "Ciao, sono Luca",
    "hero_subtitle": "Sono un Game Designer & Developer",
    "about_title": "Chi Sono",
    "about_title_p2": "I miei Contatti",
    "about_p1": "La mia passione per i videogiochi e' nata fin da bambino, ma e' stata la curiosita' di capire \"come funzionano\" a spingermi verso la laurea in Informatica.",
    "about_p2": "Junior 3D Artist con un profilo unico che unisce una solida base tecnica a una specializzazione creativa ottenuta con un Master in Videogames. Questa doppia competenza mi permette di approcciare la modellazione 3D e la creazione di asset non solo con un occhio artistico, ma anche con una profonda comprensione delle performance, dell'ottimizzazione e delle pipeline di produzione. Sono fortemente motivato a tradurre la mia passione per la grafica computerizzata in asset di alta qualita', funzionali e pronti per l'integrazione in game engine.",
    "about_p3": "Sono sempre aperto a nuove opportunita' di collaborazione e a discutere di progetti interessanti. Puoi trovarmi qui:",
    "hero_title_p2": "Le mie Competenze",
    "about_p12": "Una valutazione delle mie competenze nelle tecnologie che uso regolarmente.",
    "about_p13": "Linguaggi di Programmazione",
    "about_p14": "Motori e Software",
    "hero_title_p3": "I Miei Giochi",
    "hero_title_p4": "I Miei Lavori",
    "about_title_1": "Il Progetto",
    "about_title_2": "Il Mio contributo",
    "about_title_3": "Tecnologie Usate",
    "sthil_note": "Nota: In accordo con le direttive accademiche, il prototipo giocabile e' attualmente in fase di revisione interna per l'approvazione finale alla pubblicazione.",
    "about_p4": "Adattamento videoludico dell'opera omonima di William Hope Hodgson, Carnacki: Occult Detective, e' un'investigazione psicologica in prima persona. Il progetto nasce come tesi di laurea in Informatica e si e' evoluto in un'esplorazione complessa del game development, toccando ogni aspetto della pipeline di produzione.",
    "about_p5": "In qualita' di Solo Developer, ho gestito l'intero ciclo di vita del progetto. Inizialmente sviluppato su Unity con la HD Render Pipeline, ho curato il design delle meccaniche investigative, la programmazione del gameplay e l'integrazione degli asset. La sfida tecnica principale e' stata l'implementazione di un sistema di indizi dinamico e la gestione di un'atmosfera psicologica opprimente. Attualmente, sto migrando il progetto su Unreal Engine 5 per sfruttarne le capacita' grafiche avanzate e approfondire la mia conoscenza di un secondo motore di gioco standard del settore.",
    "about_p6": "Scrub N' Smear e' un party game cooperativo locale per due giocatori, sviluppato da zero in 34 ore durante la Game Jam del Master Game 40 di Bigrock. L'obiettivo era creare un'esperienza di gioco completa e divertente in un tempo estremamente limitato.",
    "about_p7": "Ho ricoperto il doppio ruolo di Game Designer e Lead Game Programmer. In fase di design, ho definito il core loop del gioco, ideato il sistema di punteggio e bilanciato i tre diversi power-up per garantire un gameplay dinamico e competitivo. Come programmatore, ho implementato in Blueprint (Unreal Engine 5) l'intera logica di gioco, inclusa la fisica dei personaggi, l'interazione con gli oggetti e il sistema di power-up. Questo progetto ha consolidato la mia capacita' di prototipare rapidamente e di lavorare efficacemente in team sotto pressione.",
    "about_p8": "STHIL e' un prototipo di endless runner a tema boscaiolo, creato in cinque giorni su commissione per un evento legato allo Youtuber STHIL Timbersports. Il task era tradurre le richieste del cliente e le informazioni ricevute in un'esperienza di gioco arcade e coinvolgente.",
    "about_p9": "In qualita' di Game Designer e programmatore di supporto, ho collaborato strettamente con il cliente per definire il concept e le meccaniche. Ho ideato il sistema di chopping degli ostacoli e la curva di difficolta' progressiva, ispirandomi a classici come Metal Slug. Ho tradotto l'idea in una documentazione di design chiara per il team e ho contribuito alla programmazione di specifiche meccaniche, garantendo un game flow fluido e in linea con la visione del cliente.",
    "about_p10": "Questo progetto, nato come una sfida personale durante i primi anni di universita', rappresenta il mio primo approccio pratico allo sviluppo di videogiochi. L'obiettivo non era creare un prodotto finito, ma utilizzare RPG Maker MV come strumento per comprendere le basi della logica di programmazione e del linguaggio JavaScript.",
    "about_p11": "E' stata un'esperienza fondamentale di auto-formazione. Guidato dalla passione, ho esplorato la logica degli eventi, ho iniziato a scrivere i miei primi script in JavaScript per personalizzare le meccaniche e ho imparato a gestire la struttura di un piccolo progetto. Sebbene non sia stato completato, questo progetto ha acceso la scintilla che mi ha portato a perseguire una carriera nel game development, dandomi le fondamenta per affrontare studi piu' complessi.",
    "crimson_project": "Crimsonland (titolo provvisorio) e' un'IP transmediale in fase di sviluppo, nata da un concept presentato durante il Master. Il progetto si sviluppera' a partire da un romanzo breve originale, che fungera' da world book per un videogioco investigativo narrativo in prima persona. L'esperienza di gioco e' progettata per esplorare tematiche introspettive attraverso un'ambientazione onirica, ricca di misteri e simbolismo.",
    "crimson_contrib_intro": "In qualita' di autore e Solo Developer, sto gestendo l'intero processo creativo e produttivo. La mia responsabilità principale in questa fase e' la costruzione delle fondamenta dell'IP, che include:",
    "crimson_contrib_wb_title": "World Building & Scrittura:",
    "crimson_contrib_wb_desc": "Stesura del romanzo breve, definizione della lore e sceneggiatura dei principali archi narrativi.",
    "crimson_contrib_gd_title": "Game Design:",
    "crimson_contrib_gd_desc": "Progettazione delle meccaniche investigative e del \"core loop\" di gioco.",
    "crimson_contrib_td_title": "Sviluppo Tecnico:",
    "crimson_contrib_td_desc": "Il progetto e' il mio principale campo di studio per approfondire la pipeline di produzione in Unreal Engine 5. Attualmente sto implementando i sistemi di base, dalla programmazione del controller del personaggio alla creazione di prototipi per le meccaniche di interazione.",
    "crimson_contrib_ad_title": "Art Direction:",
    "crimson_contrib_ad_desc": "Definizione dello stile visivo e realizzazione dei primi concept art.",
    "crimson_contrib_conclusion": "Questo progetto rappresenta il mio impegno nel padroneggiare non solo gli aspetti tecnici dello sviluppo, ma anche le componenti narrative e di design che creano esperienze di gioco memorabili.",
    "post1_titolo_intro": "Da Spacewar! a Unreal Engine 5: Una Riflessione Personale sulla Storia che Ispira il Mio Lavoro",
    "post1_intro": "<i> Ogni volta che avvio Unreal Engine 5 per lavorare su un mio progetto, mi fermo a pensare al percorso incredibile che ci ha portati fin qui. Da dove veniamo? Quali sono state le scintille creative che hanno dato vita all'industria che amo? Capire la storia dei videogiochi non e' solo un esercizio accademico per me; e' una fonte di ispirazione e un modo per comprendere piu' a fondo i principi di design che ancora oggi sono validi. In questo post, ripercorro alcune delle tappe fondamentali che hanno segnato l'evoluzione del nostro medium, riflettendo su come queste lezioni del passato influenzino il mio approccio come Game Designer oggi. </i>" ,
    "post1_parte1": "I videogiochi sono nati nel secolo scorso, tale fenomeno e' risaputo, ma esattamente quando e' ladata di nascita di questa nuova avanguardia? Scaturiti dalle sperimentazioni derivanti dalla innovativa tecnologia bellica, dai laboratori diricerca e da alcuni dipartimenti universitari la data forse piu' attendibile da cui ha avuto inizioquesta nuova era tecnologica e' probabilmente il 1947, quando Thomas Goldsmith e Mann Ray (da non confondere con l artista Dada, Man Ray), crearono un gioco di nuova concezione ispirati dalla tecnologia dei sistemi radar della Seconda Guerra Mondiale, a cui diedero il nome di CRADS- Cathode Ray Tube Amusement Device (Dispositivo di Divertimento a Tubo Catodico). Malgrado cio', e' difficilie identificare una data precisa per la nascita del primo videogioco in assoluto, perche' nella corsa alle prime sperimentazioni molti progetti non hanno mai realmente avuto luogo. Il gioco era stato progettato per essere giocato su un display CRT per trascinare navi e aerei nello schermo radar fino alla posizione desiderata, prendere la mira, dopodiche' premere il pulsante per fare fuoco, avendo a disposizione solo 30 secondi per regolare la traiettoria e il Blast Time. Da questo affascinante progetto, altri pionieri incoraggiati dal risultato procedettero con le sperimentazioni, e nel 1962 nasce Spacewar!, il primo gioco digitale, designato su PDP-1 e realizzato per la prima volta da Stephen Russell, Peter Samson, Dan Edwards e Mar tin Graetz, insieme ad Alan Kotok, Steve Piner e Robert A Saunders. E pensato per due giocatori, dove ogni Player controlla una della due astronavi disponibili, la Needle e la Wedge, mentre al centro una stella esercita la gravita'. Il giocatore ha a disposizione come armamento dei siluri, di scorta limitata, che possono essere lanciati contro l avversario e il gioco termina quando un Player distrugge l altro oppure quando entrambi rimangono senza munizioni. Successivamente poi pochi anni piu' tardi usci' quello che forse e' considerato come storicamen te il piu' importante videogioco di sempre, che ne sanci il significato, nel 1974 nasce PONG. Questo gioco fu il primo tentativo di dare alle masse il Family Computer Game, conosciuto  forse meglio come Famicom, che era accessibile a chiunque avesse un televisore a casa. Questo gioco leggendario fu il precursore dell industria videoludica che comincio' a diffondersi dopo la  prima met`a degli anni 70. Grazie al suo enorme successo, altri sviluppatori arrivarono a con cettualizzare e realizzare l Arcade System, meglio conosciuto come gioco cabinato, nonche' un prodotto popolare in tutto il mondo. Questo porto' alla creazione di ulteriori titoli storici, tra cui i piu' ricordati ed entrati nel cuore dei giocatori e della cultura come: Space Invaders e, ovviamente, PAC-MAN.",
    "post1_parte2": "Si nota come anche l atteggiamento e la psicologia con cui si approccia allo sviluppo del mezzo videoludico cambi nel corso del tempo, sia CRADS, Spacewar! che PONG sono impostati con una tipologia PlayerVSPlayer, mentre da Space Invaders e PAC-MAN in poi si adotta la strategia PlayerVSComputer. Con l evoluzione hardware e software si arrivo' a una significativa crescita nel campo dei Sistemi Operativi, che andarono di pari passo con l esplorazione del mondo videoludico. Le architetture degli anni 70, fondamentalmente a Circuiti Integrati, lasciarono il posto agli inizi degli anni 80 alle neonate e rivoluzionarie tecnologie, ovvero i Microprocessori, i Personal Computer e le GUI- Graphic User Interface, l Interfaccia Grafica permise infatti un approccio molto piu' intuitivo nel rapporto macchina-utente. Giungendo agli anni 90, con lo sviluppo di una nuova tecnologia, ovvero la Console System, si giunge alla attuale storia videoludica. Negli anni successivi, grazie all evoluzione tecnologica, le console cambiarono forma e com ponenti offrendo immagini pi`u dettagliate e una maggiore immersione videoludica. L industria crebbe esponenzialmente come la sua diffusione. Con lo scorrere degl anni, gli apparati artistici e informatici percepirono il bisogno di produrre una diversa concezione di coinvolgimento, arric chendo il videogame con la realizzazione di Luci e Ombre, la Dinamica dei Fluidi e la Collisione e Interazione di Forze tra Oggetti. Si inizio' ad utilizzare la tecnologia Motion Capture, non solo nelle scene di Animazione, ma anche nel Gameplay vero e proprio. All E3 - Electronic Entertainmet Expo di Los Angeles del 2018 Microsoft dichiaro' che Il futuro dei videogiochi e' nelle AI e nei servizi web, tutt oggi utilizzati per diverse attivita' come sport simulation e E-Sport. Il potere dei videogiochi, tuttavia, non `e fine a se stesso ma, ha condotto a numerose scoperte e diversi nuovi campi di ricerca, portando anche innovazione in altri settori.",
    "post1_parte3": "Con l arrivo delle AGU- Automated Game Understanding, il piu' recente campo di studi introduce l applicazione delle AI nei videogiochi, un sistema capace di effettuare determinate azioni senza l espicito programma, passando cosi' ad una nuova concezione videoludica. Il tutto viene supportato da vari algoritmi come i NEAT- Neuro Evolution of Augmenting Topologies, affermando cosi' una nuova generazione di evolute Reti Neurali. Questo tipo di sistema prova ad emulare la logica umana, poiche' il programma e' scritto in maniera tale da accettare tutti gli Input e decidere gli Output, variando le decisioni finali in tempo reale con gli eventi. L aumento della fruizione dei videogiochi durante la pandemia di COVID-19 e' un fenomeno degno di nota. Con le restrizioni sociali imposte dai vari governi, che includevano il confina mento a casa, molti hanno trovato nei videogiochi una fonte di svago e un modo per combattere la noia e l isolamento. La possibilita' di connettersi virtualmente con gli altri ha reso i video giochi non solo un passatempo, ma anche un mezzo di socializzazione in un periodo di forte distanziamento fisico. Di conseguenza, l industria ha visto un notevole incremento nelle vendi te e nell utilizzo, consolidando ulteriormente la sua posizione come una delle piu' rilevanti del settore dell intrattenimento globale.",
    "post1_titolo_outro": "Oltre la Tecnologia: La Ricerca dell'Interazione",
    "post1_outro": "Ripercorrere questa evoluzione, da un semplice punto su un tubo catodico alle complesse IA odierne, mi ricorda una verita' fondamentale: ogni grande innovazione e' partita da un'idea semplice e da un limite tecnico da superare. Come sviluppatore e designer, il mio obiettivo e' portare con me questa lezione: usare la tecnologia di oggi non solo per creare mondi piu' realistici, ma per trovare nuove, semplici ed eleganti forme di interazione, proprio come hanno fatto i pionieri prima di noi. Questo e' cio' che mi spinge a continuare a studiare, sperimentare e, soprattutto, a creare."
  },
  "en": {
    "hero_title": "Hi, I'm Luca",
    "hero_subtitle": "I'm a Game Designer & Developer",
    "about_title": "About Me",
    "about_title_p2": "My Contacts",
    "about_p1": "My passion for video games was born as a child, but it was the curiosity to understand \"how they work\" that pushed me towards a degree in Computer Science.",
    "about_p2": "Junior 3D Artist with a unique profile that combines a solid technical foundation with a creative specialization obtained with a Master's in Video Games. This dual skill set allows me to approach 3D modeling and asset creation not only with an artistic eye, but also with a deep understanding of performance, optimization, and production pipelines. I am highly motivated to translate my passion for computer graphics into high-quality, functional assets ready for game engine integration.",
    "about_p3": "I'm always open to new collaboration opportunities and to discussing interesting projects. You can find me here:",
    "hero_title_p2": "My Skills",
    "about_p12": "An assessment of my skills in the technologies i use regularly.",
    "about_p13": "Programming Languages",
    "about_p14": "Engines and Software",
    "hero_title_p3": "My Games",
    "hero_title_p4": "My Works",
    "about_title_1": "The Project",
    "about_title_2": "My Contribution",
    "about_title_3": "Used Technologies",
    "sthil_note": "Note: In accordance with academic guidelines, the playable prototype is currently undergoing internal review for final approval for publication.",
    "about_p4": "A video game adaptation of William Hope Hodgson's novel, Carnacki: Occult Detective, is a first-person psychological investigation. The project originated as my Computer Science degree thesis and has evolved into a comprehensive exploration of the game development pipeline.",
    "about_p5": "As a Solo Developer, I managed the entire project lifecycle. Initially developed in Unity using the HD Render Pipeline, I designed the core investigation mechanics, programmed the gameplay, and handled asset integration. The main technical challenge was implementing a dynamic clue system and managing an oppressive psychological atmosphere. I am currently migrating the project to Unreal Engine 5 to leverage its advanced rendering capabilities and deepen my knowledge of a second industry-standard game engine.",
    "about_p6": "Scrub N' Smear is a local cooperative party game for two players, developed from scratch in 34 hours during the Bigrock Master's Game Jam 40. The goal was to create a complete and polished gaming experience within an extremely tight deadline.",
    "about_p7": "I held the dual role of Game Designer and Lead Game Programmer. In the design phase, I defined the game's core loop, devised the scoring system, and balanced the three distinct power-ups to ensure dynamic and competitive gameplay. As a programmer, i implemented the entire game logic in Blueprint (Unreal Engine 5), including character physics, object interaction, and the power-up system. This project solidified my ability to prototype rapidly and work effectively within a team under pressure.",
    "about_p8": "STHIL is a lumberjack-themed endless runner prototype, created in five days on commission for an event related to the YouTuber STHIL Timbersports. The task was to translate client requirements and brand information into an engaging arcade game experience.",
    "about_p9": "As a Game Designer and support programmer, I worked closely with the client to define the concept and mechanics. I designed the obstacle chopping system and the progressive difficulty curve, drawing inspiration from classics like Metal Slug. I translated the idea into clear design documentation for the team and contributed to programming specific mechanics, ensuring a smooth game flow that aligned with the client's vision.",
    "about_p10": "Born from a personal challenge during my early university years, this project represents my first practical approach to video game development. The goal was not to create a finished product, but to use RPG Maker MV as a tool to understand the fundamentals of programming logic and the JavaScript language.",
    "about_p11": "This was a foundational self-learning experience. Driven by passion, I explored event-based logic, began writing my first JavaScript snippets to customize mechanics, and learned to manage a small project's structure. Although not completed, this project ignited the spark that led me to pursue a career in game development, giving me the foundations to tackle more complex studies.",
    "crimson_project": "Crimsonland (working title) is a transmedia IP currently in development, originating from a concept presented during my Master's program. The project will expand from an original short novel, which serves as the world book for a first-person narrative investigation game. The gameplay experience is designed to explore introspective themes through a dreamlike setting, rich in mystery and symbolism.",
    "crimson_contrib_intro": "As the author and Solo Developer, I am managing the entire creative and production process. My main responsibility in this phase is building the IP's foundation, which includes:",
    "crimson_contrib_wb_title": "World Building & Writing:",
    "crimson_contrib_wb_desc": "Drafting the short novel, defining the lore, and scripting the main narrative arcs.",
    "crimson_contrib_gd_title": "Game Design:",
    "crimson_contrib_gd_desc": "Designing the investigation mechanics and the core gameplay loop.",
    "crimson_contrib_td_title": "Technical Development:",
    "crimson_contrib_td_desc": "The project serves as my main field of study for mastering the Unreal Engine 5 production pipeline. I am currently implementing the base systems, from programming the character controller to prototyping interaction mechanics.",
    "crimson_contrib_ad_title": "Art Direction:",
    "crimson_contrib_ad_desc": "Defining the visual style and creating the initial concept art.",
    "crimson_contrib_conclusion": "This project represents my commitment to mastering not only the technical aspects of development but also the narrative and design components that create memorable gaming experiences.",
    "post1_titolo_intro": "From Spacewar! to Unreal Engine 5: A Personal Reflection on the History that inspires my work",
    "post1_intro": "<i> Every time I launch Unreal Engine 5 to work on one of my projects, I pause to think about the incredible journey that has brought us here. Where do we come from? What were the creative sparks that ignited the industry I love? Understanding the history of video games isn't just an academic exercise for me; it's a source of inspiration and a way to more deeply comprehend the design principles that are still valid today. In this post, I trace some of the fundamental milestones that have marked the evolution of our medium, reflecting on how these lessons from the past influence my approach as a Game Designer today.</i>",
    "post1_parte1": "Video games were born in the last century, a well-known fact, but what exactly is the birth date of this new vanguard? Stemming from experiments derived from innovative military technology, research labs, and university departments, perhaps the most reliable date for the beginning of this new technological era is likely 1947. It was then that Thomas Goldsmith and Estle Ray Mann created a groundbreaking game inspired by World War II radar systems technology, which they named the CRADS - Cathode Ray Tube Amusement Device. However, it's difficult to pinpoint a precise date for the birth of the very first video game, as many early experimental projects never truly came to fruition. The game was designed to be played on a CRT display, where players would drag ship and plane overlays onto the radar screen, take aim, and then press a button to fire, with only 30 seconds to adjust trajectory and blast time.Inspired by this fascinating project, other pioneers proceeded with their own experiments. In 1962, Spacewar! was born—the first digital game, designed on a PDP-1 and created by Stephen Russell, Peter Samson, Dan Edwards, and Martin Graetz, along with Alan Kotok, Steve Piner, and Robert A. Saunders. It was designed for two players, each controlling one of two available spaceships, the Needle and the Wedge while a star in the center exerted gravity. Each player was armed with a limited supply of torpedoes to launch at their opponent. The game ended when one player destroyed the other or when both ran out of ammunition. A few years later, what is perhaps considered historically the most important video game ever was released, solidifying the medium's significance: in 1972, PONG was created. This game was the first attempt to bring the Family Computer Game to the masses, accessible to anyone with a television at home. This legendary game was the precursor to the video game industry, which began to flourish after the mid-1970s. Thanks to its enormous success, other developers came to conceptualize and build the Arcade System, better known as the cabinet game, a product that became popular worldwide. This led to the creation of other historic titles, among the most remembered and cherished by players and culture alike, such as Space Invaders and, of course, PAC-MAN.",
    "post1_parte2": "It's notable how the attitude and psychology of game development changed over time. CRADS, Spacewar!, and PONG were all based on a Player VS Player model, whereas from Space Invaders and PAC-MAN onward, the Player VS Computer strategy was adopted. With the evolution of hardware and software, there was significant growth in the field of Operating Systems, which went hand-in-hand with the exploration of the video game world. The Integrated Circuit architectures of the 1970s gave way in the early 1980s to new and revolutionary technologies: Microprocessors, Personal Computers, and the GUI (Graphic User Interface). The GUI allowed for a much more intuitive user-machine relationship. By the 1990s, with the development of a new technology, the Console System, we arrive at modern video game history. In the following years, thanks to technological evolution, consoles changed in form and components, offering more detailed graphics and greater immersion. The industry grew exponentially, as did its reach. Over the years, the artistic and computational fields felt the need to produce a different kind of engagement, enriching video games with the implementation of Lights and Shadows, Fluid Dynamics, and the Collision and Interaction of Forces between Objects. Motion Capture technology began to be used, not only in animated scenes but also in the gameplay itself. At E3 2018 in Los Angeles, Microsoft declared that the future of gaming is in AI and web services, which are used today for various activities like sports simulations and E-Sports. The power of video games, however, is not an end in itself; it has led to numerous discoveries and new fields of research, bringing innovation to other sectors as well.",
    "post1_parte3": "With the arrival of AGU (Automated Game Understanding), the most recent field of study introduces the application of AI in videogames, a system capable of performing certain actions without explicit programming, thus ushering in a new conception of gaming. This is supported by various algorithms like NEAT (NeuroEvolution of Augmenting Topologies), establishing a new generation of advanced Neural Networks. This type of system attempts to emulate human logic, as the program is written to accept all inputs and decide the outputs, varying final decisions in real-time with events. The increase in video game consumption during the COVID-19 pandemic is a noteworthy phenomenon. With social restrictions imposed by various governments, including lockdowns, many found in video games a source of entertainment and a way to combat boredom and isolation. The ability to connect virtually with others made video games not just a pastime but also a means of socialization during a period of intense physical distancing. Consequently, the industry saw a significant increase in sales and usage, further cementing its position as one of the most relevant in the global entertainment sector.",
    "post1_titolo_outro": "Beyond Technology: The Quest for Interaction",
    "post1_outro": "Retracing this evolution, from a simple dot on a cathode ray tube to the complex AIs of today, reminds me of a fundamental truth: every great innovation began with a simple idea and a technical limitation to overcome. As a developer and designer, my goal is to carry this lesson with me: to use today's technology not only to create more realistic worlds but to find new, simple, and elegant forms of interaction, just as the pioneers before us did. This is what drives me to continue studying, experimenting, and, above all, creating."
  }
}