{
  "it": {
    "hero_title": "Ciao, sono Luca",
    "hero_subtitle": "Sono un Game Designer & Developer",
    "about_title": "Chi Sono",
    "about_title_p2": "I miei Contatti",
    "about_p1": "La mia passione per i videogiochi e' nata fin da bambino, ma e' stata la curiosita' di capire \"come funzionano\" a spingermi verso la laurea in Informatica.",
    "about_p2": "Junior 3D Artist con un profilo unico che unisce una solida base tecnica a una specializzazione creativa ottenuta con un Master in Videogames. Questa doppia competenza mi permette di approcciare la modellazione 3D e la creazione di asset non solo con un occhio artistico, ma anche con una profonda comprensione delle performance, dell'ottimizzazione e delle pipeline di produzione. Sono fortemente motivato a tradurre la mia passione per la grafica computerizzata in asset di alta qualita', funzionali e pronti per l'integrazione in game engine.",
    "about_p3": "Sono sempre aperto a nuove opportunita' di collaborazione e a discutere di progetti interessanti. Puoi trovarmi qui:",
    "hero_title_p2": "Le mie Competenze",
    "about_p5": "Una valutazione delle mie competenze nelle tecnologie che uso regolarmente.",
    "about_p6": "Linguaggi di Programmazione",
    "about_p7": "Motori e Software",
    "hero_title_p3": "I Miei Giochi",
    "hero_title_p4": "I Miei Lavori",
    "about_title_1": "Il Progetto",
    "about_title_2": "Il Mio contributo",
    "about_title_3": "Tecnologie Usate",
    "sthil_note": "Nota: In accordo con le direttive accademiche, il prototipo giocabile e' attualmente in fase di revisione interna per l'approvazione finale alla pubblicazione.",
    "about_p4": "Adattamento videoludico dell'opera omonima di William Hope Hodgson, Carnacki: Occult Detective, e' un'investigazione psicologica in prima persona. Il progetto nasce come tesi di laurea in Informatica e si e' evoluto in un'esplorazione complessa del game development, toccando ogni aspetto della pipeline di produzione.",
    "about_p5": "In qualita' di Solo Developer, ho gestito l'intero ciclo di vita del progetto. Inizialmente sviluppato su Unity con la HD Render Pipeline, ho curato il design delle meccaniche investigative, la programmazione del gameplay e l'integrazione degli asset. La sfida tecnica principale e' stata l'implementazione di un sistema di indizi dinamico e la gestione di un'atmosfera psicologica opprimente. Attualmente, sto migrando il progetto su Unreal Engine 5 per sfruttarne le capacità grafiche avanzate e approfondire la mia conoscenza di un secondo motore di gioco standard del settore.",
    "about_p6": "Scrub N' Smear e' un party game cooperativo locale per due giocatori, sviluppato da zero in 34 ore durante la Game Jam del Master Game 40 di Bigrock. L'obiettivo era creare un'esperienza di gioco completa e divertente in un tempo estremamente limitato.",
    "about_p7": "Ho ricoperto il doppio ruolo di Game Designer e Lead Game Programmer. In fase di design, ho definito il core loop del gioco, ideato il sistema di punteggio e bilanciato i tre diversi power-up per garantire un gameplay dinamico e competitivo. Come programmatore, ho implementato in Blueprint (Unreal Engine 5) l'intera logica di gioco, inclusa la fisica dei personaggi, l'interazione con gli oggetti e il sistema di power-up. Questo progetto ha consolidato la mia capacita' di prototipare rapidamente e di lavorare efficacemente in team sotto pressione.",
    "about_p8": "STHIL e' un prototipo di endless runner a tema boscaiolo, creato in cinque giorni su commissione per un evento legato allo Youtuber STHIL Timbersports. Il task era tradurre le richieste del cliente e le informazioni ricevute in un'esperienza di gioco arcade e coinvolgente.",
    "about_p9": "In qualita' di Game Designer e programmatore di supporto, ho collaborato strettamente con il cliente per definire il concept e le meccaniche. Ho ideato il sistema di chopping degli ostacoli e la curva di difficolta' progressiva, ispirandomi a classici come Metal Slug. Ho tradotto l'idea in una documentazione di design chiara per il team e ho contribuito alla programmazione di specifiche meccaniche, garantendo un game flow fluido e in linea con la visione del cliente.",
    "about_p10": "Questo progetto, nato come una sfida personale durante i primi anni di universita', rappresenta il mio primo approccio pratico allo sviluppo di videogiochi. L'obiettivo non era creare un prodotto finito, ma utilizzare RPG Maker MV come strumento per comprendere le basi della logica di programmazione e del linguaggio JavaScript.",
    "about_p11": "E' stata un'esperienza fondamentale di auto-formazione. Guidato dalla passione, ho esplorato la logica degli eventi, ho iniziato a scrivere i miei primi script in JavaScript per personalizzare le meccaniche e ho imparato a gestire la struttura di un piccolo progetto. Sebbene non sia stato completato, questo progetto ha acceso la scintilla che mi ha portato a perseguire una carriera nel game development, dandomi le fondamenta per affrontare studi piu' complessi.",
    "crimson_project": "Crimsonland (titolo provvisorio) e' un'IP transmediale in fase di sviluppo, nata da un concept presentato durante il Master. Il progetto si sviluppera' a partire da un romanzo breve originale, che fungera' da world book per un videogioco investigativo narrativo in prima persona. L'esperienza di gioco e' progettata per esplorare tematiche introspettive attraverso un'ambientazione onirica, ricca di misteri e simbolismo.",
    "crimson_contrib_intro": "In qualita' di autore e Solo Developer, sto gestendo l'intero processo creativo e produttivo. La mia responsabilità principale in questa fase e' la costruzione delle fondamenta dell'IP, che include:",
    "crimson_contrib_wb_title": "World Building & Scrittura:",
    "crimson_contrib_wb_desc": "Stesura del romanzo breve, definizione della lore e sceneggiatura dei principali archi narrativi.",
    "crimson_contrib_gd_title": "Game Design:",
    "crimson_contrib_gd_desc": "Progettazione delle meccaniche investigative e del \"core loop\" di gioco.",
    "crimson_contrib_td_title": "Sviluppo Tecnico:",
    "crimson_contrib_td_desc": "Il progetto e' il mio principale campo di studio per approfondire la pipeline di produzione in Unreal Engine 5. Attualmente sto implementando i sistemi di base, dalla programmazione del controller del personaggio alla creazione di prototipi per le meccaniche di interazione.",
    "crimson_contrib_ad_title": "Art Direction:",
    "crimson_contrib_ad_desc": "Definizione dello stile visivo e realizzazione dei primi concept art.",
    "crimson_contrib_conclusion": "Questo progetto rappresenta il mio impegno nel padroneggiare non solo gli aspetti tecnici dello sviluppo, ma anche le componenti narrative e di design che creano esperienze di gioco memorabili."
  },
  "en": {
    "hero_title": "Hi, I'm Luca",
    "hero_subtitle": "I'm a Game Designer & Developer",
    "about_title": "About Me",
    "about_title_p2": "My Contacts",
    "about_p1": "My passion for video games was born as a child, but it was the curiosity to understand \"how they work\" that pushed me towards a degree in Computer Science.",
    "about_p2": "Junior 3D Artist with a unique profile that combines a solid technical foundation with a creative specialization obtained with a Master's in Video Games. This dual skill set allows me to approach 3D modeling and asset creation not only with an artistic eye, but also with a deep understanding of performance, optimization, and production pipelines. I am highly motivated to translate my passion for computer graphics into high-quality, functional assets ready for game engine integration.",
    "about_p3": "I'm always open to new collaboration opportunities and to discussing interesting projects. You can find me here:",
    "hero_title_p2": "My Skills",
    "about_p5": "An assessment of my skills in the technologies i use regularly.",
    "about_p6": "Programming Languages",
    "about_p7": "Engines and Software",
    "hero_title_p3": "My Games",
    "hero_title_p4": "My Works",
    "about_title_1": "The Project",
    "about_title_2": "My Contribution",
    "about_title_3": "Used Technologies",
    "sthil_note": "Note: In accordance with academic guidelines, the playable prototype is currently undergoing internal review for final approval for publication.",
    "about_p4": "A video game adaptation of William Hope Hodgson's novel, Carnacki: Occult Detective, is a first-person psychological investigation. The project originated as my Computer Science degree thesis and has evolved into a comprehensive exploration of the game development pipeline.",
    "about_p5": "As a Solo Developer, I managed the entire project lifecycle. Initially developed in Unity using the HD Render Pipeline, I designed the core investigation mechanics, programmed the gameplay, and handled asset integration. The main technical challenge was implementing a dynamic clue system and managing an oppressive psychological atmosphere. I am currently migrating the project to Unreal Engine 5 to leverage its advanced rendering capabilities and deepen my knowledge of a second industry-standard game engine.",
    "about_p6": "Scrub N' Smear is a local cooperative party game for two players, developed from scratch in 34 hours during the Bigrock Master's Game Jam 40. The goal was to create a complete and polished gaming experience within an extremely tight deadline.",
    "about_p7": "I held the dual role of Game Designer and Lead Game Programmer. In the design phase, I defined the game's core loop, devised the scoring system, and balanced the three distinct power-ups to ensure dynamic and competitive gameplay. As a programmer, i implemented the entire game logic in Blueprint (Unreal Engine 5), including character physics, object interaction, and the power-up system. This project solidified my ability to prototype rapidly and work effectively within a team under pressure.",
    "about_p8": "STHIL is a lumberjack-themed endless runner prototype, created in five days on commission for an event related to the YouTuber STHIL Timbersports. The task was to translate client requirements and brand information into an engaging arcade game experience.",
    "about_p9": "As a Game Designer and support programmer, I worked closely with the client to define the concept and mechanics. I designed the obstacle chopping system and the progressive difficulty curve, drawing inspiration from classics like Metal Slug. I translated the idea into clear design documentation for the team and contributed to programming specific mechanics, ensuring a smooth game flow that aligned with the client's vision.",
    "about_p10": "Born from a personal challenge during my early university years, this project represents my first practical approach to video game development. The goal was not to create a finished product, but to use RPG Maker MV as a tool to understand the fundamentals of programming logic and the JavaScript language.",
    "about_p11": "This was a foundational self-learning experience. Driven by passion, I explored event-based logic, began writing my first JavaScript snippets to customize mechanics, and learned to manage a small project's structure. Although not completed, this project ignited the spark that led me to pursue a career in game development, giving me the foundations to tackle more complex studies.",
    "crimson_project": "Crimsonland (working title) is a transmedia IP currently in development, originating from a concept presented during my Master's program. The project will expand from an original short novel, which serves as the world book for a first-person narrative investigation game. The gameplay experience is designed to explore introspective themes through a dreamlike setting, rich in mystery and symbolism.",
    "crimson_contrib_intro": "As the author and Solo Developer, I am managing the entire creative and production process. My main responsibility in this phase is building the IP's foundation, which includes:",
    "crimson_contrib_wb_title": "World Building & Writing:",
    "crimson_contrib_wb_desc": "Drafting the short novel, defining the lore, and scripting the main narrative arcs.",
    "crimson_contrib_gd_title": "Game Design:",
    "crimson_contrib_gd_desc": "Designing the investigation mechanics and the core gameplay loop.",
    "crimson_contrib_td_title": "Technical Development:",
    "crimson_contrib_td_desc": "The project serves as my main field of study for mastering the Unreal Engine 5 production pipeline. I am currently implementing the base systems, from programming the character controller to prototyping interaction mechanics.",
    "crimson_contrib_ad_title": "Art Direction:",
    "crimson_contrib_ad_desc": "Defining the visual style and creating the initial concept art.",
    "crimson_contrib_conclusion": "This project represents my commitment to mastering not only the technical aspects of development but also the narrative and design components that create memorable gaming experiences."
  }
}